class/test/tsung/create_users.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="whogoesthere.c2y2jbcu8i.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="Create User" probability="100" type="ts_http">
      <request>
        <http url='/'></http>
      </request>


      <request>
	    <dyn_variable name="authenticity_token"/>
        <http url='/users/new'></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars> 

      <thinktime random="true" value="2"/>

      <request subst="true">
	    <dyn_variable name="created_user_id" re="Location: http://.*/users/(.*)\r"/>
        <http url='/users' method='POST' contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bname%5D=test&amp;user%5Bemail%5D=test%%ts_user_server:get_unique_id%%@mail.com"></http>
      </request>

      <request subst="true">
        <http url='/users/%%_created_user_id%%'></http>
      </request>

      <thinktime random="true" value="1"/>

      <request subst="true">
        <http url='/users/'></http>
      </request>

      <thinktime random="true" value="1"/>

      <request subst="true">
        <http url='/users/'></http>
      </request>
    </session>
  </sessions>
</tsung>